Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
                      + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0dc56fd33aba2306e09abbefa9a0566c0c445fd561e6f623a844a82a04b823c3.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0dc56fd33aba2306e09abbefa9a0566c0c445fd561e6f623a844a82a04b823c3.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2934161093654168691" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b543027660ad53ae52d1e355a7d853e848201fe0fbf885fd5645831d03449398.zip" -> "builds/0dc56fd33aba2306e09abbefa9a0566c0c445fd561e6f623a844a82a04b823c3.zip"
          ~ "timestamp" = "1758702850943837000" -> "1758777977978698000"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1261267294397773068" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758702849630027000" -> "1758777975145589200"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-dbsnp"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:15",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6913180305795162087" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758702864845182000" -> "1758777990944784000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:15",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7868226085199280181" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758702864835230200" -> "1758777990857816000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/9934b39ce9810f670883b0ddae38d507e97916558c70f894eab7b3a83ae38927.zip" -> "builds/5eaa67e09f83fe09ed881de7f26d894193213040dfce6aee880f62ca16bf9d7b.zip"
        id                             = "pgxflow-backend-lookup"
      ~ last_modified                  = "2025-09-24T08:38:06.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:15",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/lookup",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/5eaa67e09f83fe09ed881de7f26d894193213040dfce6aee880f62ca16bf9d7b.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/5eaa67e09f83fe09ed881de7f26d894193213040dfce6aee880f62ca16bf9d7b.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5808186051544246259" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9934b39ce9810f670883b0ddae38d507e97916558c70f894eab7b3a83ae38927.zip" -> "builds/5eaa67e09f83fe09ed881de7f26d894193213040dfce6aee880f62ca16bf9d7b.zip"
          ~ "timestamp" = "1758702864927675000" -> "1758777991060637000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7705457281254873883" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758702864941647000" -> "1758777990844085000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "745963d8a56a8ef8aea05863364004c6d143bafd"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/pharmcat"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:4f065d2968a23e635db5d596fa285f48411aa22675be34f93e70f3cc13f75815" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ sha256_digest        = "sha256:4f065d2968a23e635db5d596fa285f48411aa22675be34f93e70f3cc13f75815" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "d3d37b931ae36c97332d72b49b733bdd5dd3365f" -> "745963d8a56a8ef8aea05863364004c6d143bafd"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:68443b1a2b145efc98015283676dd5d59526bb5bb28f763369d5e0666c6ab3e7496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:68443b1a2b145efc98015283676dd5d59526bb5bb28f763369d5e0666c6ab3e7" -> (known after apply)
        name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ repo_digest  = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers@sha256:ea57f99825f0327d6a160e1a372779f1bec92456124c52e3b8ba779cabdd8880" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "519269b64fedb3df7f753fccdb6a0b35d078425f" -> "1ff9e0b55ee6c3ee11066560383c58c73aff8e69"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/pipeline_pharmcat/lambda/preprocessor" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/preprocessor"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:ea57f99825f0327d6a160e1a372779f1bec92456124c52e3b8ba779cabdd8880" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ sha256_digest        = "sha256:ea57f99825f0327d6a160e1a372779f1bec92456124c52e3b8ba779cabdd8880" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "519269b64fedb3df7f753fccdb6a0b35d078425f" -> "1ff9e0b55ee6c3ee11066560383c58c73aff8e69"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:15",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5896770795752107817" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758702865144084000" -> "1758777991125853000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:4f065d2968a23e635db5d596fa285f48411aa22675be34f93e70f3cc13f75815" -> (known after apply)
      ~ last_modified                  = "2025-09-24T08:38:08.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-postprocessor"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:15",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7676285822637602780" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758702865159771000" -> "1758777991215118000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-preprocessor"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers@sha256:ea57f99825f0327d6a160e1a372779f1bec92456124c52e3b8ba779cabdd8880" -> (known after apply)
      ~ last_modified                  = "2025-09-24T08:38:54.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1913637297236843711" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758702865040392000" -> "1758777991066845000"
            # (1 unchanged element hidden)
        }
    }

Plan: 74 to add, 40 to change, 64 to destroy.
module.webgui.terraform_data.cloudfront-version-invalidate: Destroying... [id=4b89485e-b53e-84af-a882-265bd4d60bee]
module.webgui.terraform_data.cloudfront-version-invalidate: Destruction complete after 0s
module.webgui.null_resource.cloudfront-invalidate: Destroying... [id=876215801959427958]
module.webgui.null_resource.cloudfront-invalidate: Destruction complete after 0s
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0]: Creating...
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0]: Creation complete after 0s [id=bb2253fd4f2c9a81c19fa7ec0abccdad38bbfed6]
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Provisioning with 'local-exec'...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: creating 'builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.zip' archive
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/pgxflow/pipeline_pharmcat/lambda/postprocessor
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: adding: drugs.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: adding: genes.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: adding: messages.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: adding: utils.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): Created: builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.zip
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0]: Creation complete after 0s [id=3907398637554650944]
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creating...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] (local-exec): zip: creating 'builds/a928cd25a8d6530207d17e12f0148b7fc2b7557fb65cdb5f1a054735bf0ec4f4.zip' archive
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): zip: creating 'builds/3316265c984f10f28b74b942f005ca4bb3c4c820411309d6cad169ca769dffd9.zip' archive
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/pgxflow/pipeline_lookup/lambda/gnomad
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): Created: builds/3316265c984f10f28b74b942f005ca4bb3c4c820411309d6cad169ca769dffd9.zip
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/pgxflow/pipeline_pharmcat/lambda/gnomad
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] (local-exec): Created: builds/a928cd25a8d6530207d17e12f0148b7fc2b7557fb65cdb5f1a054735bf0ec4f4.zip
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0]: Creation complete after 0s [id=8476354150018045088]
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creating...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Provisioning with 'local-exec'...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip' archive
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/updateFiles
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): Created: builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: creating 'builds/fe6b6b2df7d0d7d33c906b62c9d022f7e0b8b641a4db7fa99a803c983363bd63.zip' archive
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/pgxflow/lambda/batchStarter
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0]: Creation complete after 0s [id=1094150180864258530]
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): Created: builds/fe6b6b2df7d0d7d33c906b62c9d022f7e0b8b641a4db7fa99a803c983363bd63.zip
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creation complete after 0s [id=8222633687769417348]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): zip: creating 'builds/7f3d5d2365929c58630c64ceb3bbaee0dc7b160819f471756fc493fda696d073.zip' archive
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/pgxflow/pipeline_lookup/lambda/dbsnp
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): Created: builds/7f3d5d2365929c58630c64ceb3bbaee0dc7b160819f471756fc493fda696d073.zip
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/b2aa315848da684e512f08a084330d1fe4fc5310bc70674df2bd154c68a31c04.zip' archive
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/pgxflow/pipeline_pharmcat/lambda/updateReferenceFiles
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: pharmcat.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: pharmcat.sh
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: creating 'builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip' archive
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/error_catcher/lambda/notifyOnError
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: version_checks.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Created: builds/b2aa315848da684e512f08a084330d1fe4fc5310bc70674df2bd154c68a31c04.zip
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): Created: builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0]: Creation complete after 0s [id=3150074930185936629]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0]: Creation complete after 1s [id=1488505101478291075]
module.webgui.null_resource.s3-upload: Destroying... [id=2863437767749125622]
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creation complete after 1s [id=3780843676296434256]
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip' archive
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/deidentifyFiles
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: deidentification.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: file_validation.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: launch_ec2.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): Created: builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: creating 'builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip' archive
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/security/lambda/sendSecurityAlert
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.zip' archive
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: inspector.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/pgxflow/pipeline_lookup/lambda/updateReferenceFiles
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: dbsnp.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: dbsnp.sh
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: version_checks.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Created: builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.zip
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creation complete after 1s [id=3950087202629994093]
module.webgui.null_resource.s3-upload: Destruction complete after 0s
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0]: Creation complete after 1s [id=5525064514124565887]
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): Created: builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: creating 'builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip' archive
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/cognito/lambda/logEmailDelivery
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): Created: builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0]: Creation complete after 1s [id=8205860834852369303]
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creation complete after 1s [id=6798561046680864866]
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creation complete after 1s [id=1764034969743491924]
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0]: Creating...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (deposed object 00562529): Destroying... [id=8650366602970060527]
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creating...
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0]: Provisioning with 'local-exec'...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Destruction complete after 0s
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creating...
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creation complete after 0s [id=463dc02c8b75a8bd11f23d737e9beb3b0d85ff2d]
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creating...
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=f04bfd073a9aff07c8d865adfcba970c18174085]
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creation complete after 0s [id=975897eb2f5f910627f7d07dcd56fc48362f10ef]
module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Creating...
module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=77f05df682b1a096993850561b3d2369be094f0d]
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: creating 'builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip' archive
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/pgxflow/lambda/qcNotes
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): Created: builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: creating 'builds/b13c4a78bd55bc20d4dc8147578c931acb0b836487b00cbfec051c64a7693bf8.zip' archive
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/pgxflow/lambda/getResultsURL
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): Created: builds/b13c4a78bd55bc20d4dc8147578c931acb0b836487b00cbfec051c64a7693bf8.zip
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0]: Creation complete after 0s [id=6063919685553700881]
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): zip: creating 'builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip' archive
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/customMessageLambdaTrigger/requirements.txt
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-k1si7hdc
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-k1si7hdc
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0]: Creation complete after 0s [id=7313179193000078813]
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): zip: creating 'builds/5eaa67e09f83fe09ed881de7f26d894193213040dfce6aee880f62ca16bf9d7b.zip' archive
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/pgxflow/pipeline_lookup/lambda/lookup
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): zip: adding: __pycache__/
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): zip: adding: __pycache__/lambda_function.cpython-312.pyc
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): Created: builds/5eaa67e09f83fe09ed881de7f26d894193213040dfce6aee880f62ca16bf9d7b.zip
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip' archive
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: creating 'builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip' archive
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/performQuery
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: query_builder.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: query_engine.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): Created: builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/getIndividuals
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Creation complete after 0s [id=5600336559531572774]
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_filtering_terms.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_biosamples.py
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip' archive
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/splitQuery
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): Created: builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_g_variants.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): Created: builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: creating 'builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip' archive
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/getConfiguration
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: creating 'builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip' archive
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/getProjects
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): Created: builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/__init__.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/models.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): Created: builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0]: Creation complete after 0s [id=1266548827076855639]
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creation complete after 0s [id=8808275706926618453]
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creation complete after 0s [id=1714744312826526469]
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creation complete after 1s [id=4193546650025187235]
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Creation complete after 1s [id=8126355393782456928]
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creation complete after 0s [id=4b7d5a0790db5ad96718d213e17679f990f55046]
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: creating 'builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip' archive
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/getAnalyses
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: creating 'builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip' archive
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/getRuns
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_filtering_terms.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_filtering_terms.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_analyses.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_g_variants.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id_g_variants.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): Created: builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): Created: builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: creating 'builds/4210711773ed925dad12fb420efb6a5ef9a7debed13d0e2751af6c37c3a1638d.zip' archive
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creation complete after 0s [id=7512273542077467341]
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/pgxflow/lambda/batchSubmit
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): Created: builds/4210711773ed925dad12fb420efb6a5ef9a7debed13d0e2751af6c37c3a1638d.zip
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0]: Creation complete after 1s [id=5783825099276013491]
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: creating 'builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip' archive
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/getMap
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): Created: builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): zip: creating 'builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip' archive
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/getInfo
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): Created: builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creation complete after 1s [id=2050868282970410540]
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Creation complete after 1s [id=6153284818496195036]
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: creating 'builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip' archive
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/getBiosamples
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_filtering_terms.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_analyses.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_g_variants.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_runs.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): Created: builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Creation complete after 0s [id=7264333584386405445]
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Creation complete after 1s [id=8419791067022673584]
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creating...
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creation complete after 0s [id=08fd4c451779531093d124c91a6a2987f6130db4]
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: creating 'builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip' archive
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: creating 'builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip' archive
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/getEntryTypes
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): Created: builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/298/default/sbeacon/lambda/getFilteringTerms
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): Created: builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creation complete after 0s [id=6178413666870869352]
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creation complete after 0s [id=841762659330209822]
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (deposed object 32d6e81a): Destroying... [id=6596441518659250835]
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Destruction complete after 0s
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (deposed object 5d5efd16): Destroying... [id=1261267294397773068]
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Destruction complete after 0s
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/8225510b62bf60b687b5614da58232658f9caa7053aed32e35c914e3cf72c09e.zip' archive
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/sendClinicJobEmail/requirements.txt
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-foau31vw
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-foau31vw
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirem
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.